WORKSHEET_EXPENSE = "Витрати"

WORKSHEET_INCOME = "Доходи"

COLUMN_ORDER = ["date", "category", "amount", "note", "submitted_at", "added_at", "device_info"]

CATEGORIES = {
    "expense": [
        "Продукти",
        "Транспорт",
        "Подарунки",
        "Господарство",
        "Комісія",
        "Доставка",
        "Кафе / ресторани / кава",
        "Розваги",
        "Техніка",
        "Інше",
        "Різниця курсів",
        "Медицина",
        "Житло",
        "Книжки",
        "Телефон",
        "Одяг",
        "Перукарня",
        "Тварини",
        "Подорож",
        "Благодійність",
        "Музика",
        "Підписки",
        "Навчання",
        "Інвестиції",
        "Інтернет",
        "Одноразова покупка",
        "Зброя",
        "Меблі",
        "Податки",
        "Посуд",
        "Спорт",
    ],
    "income": [
        "Відсотки",
        "Кешбек",
        "Зарплата",
        "Повернення коштів",
        "Переказ від тата",
        "Інвестиції",
        "Стипендія",
        "Різниця курсів",
        "Готівка від тата",
        "Інше",
        "Готівка від мами",
        "Переказ від мами",
        "ОВДП",
        "Переказ від Толі",
        "Готівка від Толі"
    ],
}